#+TITLE:Sight Agenda
#+TODO: TODO(t) WAIT(w@/!) | CANCELLED(c@) DONE(d) OUT(o)

* 2020

** TODO Standup Mon
   SCHEDULED: <2020-05-18 Mon 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-05-17 Sun 12:15]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-04-27 Mon 09:30]--[2020-04-27 Mon 10:30] =>  1:00
   CLOCK: [2020-05-04 Mon 10:00]--[2020-05-04 Mon 10:30] =>  0:30
   CLOCK: [2020-05-11 Mon 10:00]--[2020-05-11 Mon 10:30] =>  0:30
   :END:

** TODO Standup Tue
   SCHEDULED: <2020-05-19 Tue 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-05-17 Sun 12:15]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-05-05 Tue 10:00]--[2020-05-05 Tue 10:30] =>  0:30
   CLOCK: [2020-05-12 Tue 10:00]--[2020-05-12 Tue 10:30] =>  0:30
   :END:

** TODO Standup Wed
   SCHEDULED: <2020-05-20 Wed ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-05-17 Sun 12:15]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-05-13 Wed 10:00]--[2020-05-13 Wed 10:30] =>  0:30
   CLOCK: [2020-05-06 Wed 10:00]--[2020-05-06 Wed 10:30] =>  0:30
   CLOCK: [2020-04-29 Wed 10:00]--[2020-04-29 Wed 10:30] =>  0:30
   :END:

** TODO Standup Thu
   SCHEDULED: <2020-05-21 Thu ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-05-17 Sun 12:16]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-05-14 Thu 10:00]--[2020-05-14 Thu 10:30] =>  0:30
   CLOCK: [2020-05-07 Thu 10:00]--[2020-05-07 Thu 10:30] =>  0:30
   CLOCK: [2020-04-30 Thu 10:00]--[2020-04-30 Thu 10:30] =>  0:30
   :END:

** TODO Standup Fri
   SCHEDULED: <2020-05-22 Fri ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-05-17 Sun 12:16]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-05-15 Fri 10:00]--[2020-05-15 Fri 10:30] =>  0:30
   CLOCK: [2020-05-08 Fri 10:00]--[2020-05-08 Fri 10:30] =>  0:30
   CLOCK: [2020-05-01 Fri 10:00]--[2020-05-01 Fri 10:30] =>  0:30
   :END:


** Week 17

   #+BEGIN: clocktable :block lastweek :maxlevel 3
   #+CAPTION: Clock summary at [2020-05-04 Mon 06:02], for week 2020-W18.
   | Headline                            | Time      |         |       |
   |-------------------------------------+-----------+---------+-------|
   | *Total time*                        | *1d 7:00* |         |       |
   |-------------------------------------+-----------+---------+-------|
   | 2020                                | 1d 7:00   |         |       |
   | \_  Standup Mon                     |           |    1:00 |       |
   | \_  Standup Wed                     |           |    0:30 |       |
   | \_  Standup Thu                     |           |    0:30 |       |
   | \_  Standup Fri                     |           |    0:30 |       |
   | \_  Week 17                         |           | 1d 4:30 |       |
   | \_    examine web hosting solutions |           |         |  3:00 |
   | \_    initialize dotnet mvc project |           |         |  3:00 |
   | \_    develop basic makefile        |           |         |  1:00 |
   | \_    base html page layout         |           |         | 14:00 |
   | \_    about us page                 |           |         |  7:30 |
   #+END

*** DONE jones brennan cogent view overview                          :ATTACH:
    :PROPERTIES:
    :ID:       64615703-422b-461f-9bf4-a8e8815f1726
    :END:

*** DONE examine web hosting solutions
    :LOGBOOK:
    CLOCK: [2020-04-27 Mon 10:30]--[2020-04-27 Mon 13:30] =>  3:00
    :END:

*** DONE initialize dotnet mvc project
    :LOGBOOK:
    CLOCK: [2020-04-28 Tue 12:30]--[2020-04-28 Tue 15:30] =>  3:00
    :END:

*** DONE develop basic makefile
    :LOGBOOK:
    CLOCK: [2020-04-29 Wed 09:00]--[2020-04-29 Wed 10:00] =>  1:00
    :END:

*** DONE base html page layout
    :LOGBOOK:
    CLOCK: [2020-04-29 Wed 10:30]--[2020-04-29 Wed 16:00] =>  6:00
    CLOCK: [2020-04-30 Thu 07:30]--[2020-04-30 Thu 10:00] =>  2:30
    CLOCK: [2020-04-30 Thu 10:30]--[2020-04-30 Thu 16:30] =>  4:30
    :END:

*** DONE about us page
    :LOGBOOK:
    CLOCK: [2020-05-01 Fri 8:00]--[2020-05-01 Fri 10:00] =>  2:00
    CLOCK: [2020-05-01 Fri 10:30]--[2020-05-01 Fri 12:00] =>  1:30
    CLOCK: [2020-05-03 Sun 12:00]--[2020-05-03 Sun 16:00] =>  4:00
    :END:


** Week 18

   #+BEGIN: clocktable :block week :maxlevel 3
   #+CAPTION: Clock summary at [2020-05-10 Sun 20:37], for week 2020-W19.
   | Headline                                | Time       |          |      |
   |-----------------------------------------+------------+----------+------|
   | *Total time*                            | *1d 16:00* |          |      |
   |-----------------------------------------+------------+----------+------|
   | 2020                                    | 1d 16:00   |          |      |
   | \_  Standup Mon                         |            |     0:30 |      |
   | \_  Standup Tue                         |            |     0:30 |      |
   | \_  Standup Wed                         |            |     0:30 |      |
   | \_  Standup Thu                         |            |     0:30 |      |
   | \_  Standup Fri                         |            |     0:30 |      |
   | \_  Week 18                             |            | 1d 13:30 |      |
   | \_    local db context                  |            |          | 9:30 |
   | \_    identity server                   |            |          | 7:00 |
   | \_    account management front end      |            |          | 5:30 |
   | \_    display "logged-in" status on bar |            |          | 1:30 |
   | \_    fix logout                        |            |          | 6:00 |
   | \_    fix email sender                  |            |          | 0:30 |
   | \_    start station page                |            |          | 7:30 |
   #+END

*** DONE local db context
    :LOGBOOK:
    CLOCK: [2020-05-04 Mon 08:00]--[2020-05-04 Mon 10:00] =>  2:00
    CLOCK: [2020-05-04 Mon 10:30]--[2020-05-04 Mon 16:00] =>  5:30
    CLOCK: [2020-05-05 Tue 08:00]--[2020-05-05 Tue 10:00] =>  2:00
    :END:

*** DONE identity server
    :LOGBOOK:
    CLOCK: [2020-05-06 Wed 08:00]--[2020-05-06 Wed 10:00] =>  2:00
    CLOCK: [2020-05-05 Tue 10:30]--[2020-05-05 Tue 15:30] =>  5:00
    :END:

*** DONE account management front end
     :LOGBOOK:
     CLOCK: [2020-05-06 Wed 10:30]--[2020-05-06 Wed 16:00] =>  5:30
     :END:

*** DONE display "logged-in" status on bar
    :LOGBOOK:
    CLOCK: [2020-05-07 Thu 08:00]--[2020-05-07 Thu 9:30] =>  1:30
    :END:

*** DONE fix logout
    :LOGBOOK:
    CLOCK: [2020-05-07 Thu 10:30]--[2020-05-07 Thu 16:00] =>  5:30
    CLOCK: [2020-05-07 Thu 09:30]--[2020-05-07 Thu 10:00] =>  0:30
    :END:

*** CANCELLED fix email sender
    - State "CANCELLED"  from "TODO"       [2020-05-08 Fri 10:00] \\
      split into more issues
    :LOGBOOK:
    CLOCK: [2020-05-08 Fri 09:30]--[2020-05-08 Fri 10:00] =>  0:30
    :END:

*** DONE start station page
    :LOGBOOK:
    CLOCK: [2020-05-10 Sun 15:00]--[2020-05-10 Sun 19:30] =>  4:30
    CLOCK: [2020-05-08 Fri 10:30]--[2020-05-08 Fri 13:30] =>  3:00
    :END:


** Week 19

   #+BEGIN: clocktable :block week :maxlevel 3
   #+CAPTION: Clock summary at [2020-05-17 Sun 12:34], for week 2020-W20.
   | Headline           | Time       |          |          |
   |--------------------+------------+----------+----------|
   | *Total time*       | *1d 16:00* |          |          |
   |--------------------+------------+----------+----------|
   | 2020               | 1d 16:00   |          |          |
   | \_  Standup Mon    |            |     0:30 |          |
   | \_  Standup Tue    |            |     0:30 |          |
   | \_  Standup Wed    |            |     0:30 |          |
   | \_  Standup Thu    |            |     0:30 |          |
   | \_  Standup Fri    |            |     0:30 |          |
   | \_  Week 19        |            | 1d 13:30 |          |
   | \_    station page |            |          | 1d 13:30 |
   #+END

*** TODO station page
    :LOGBOOK:
    CLOCK: [2020-05-17 Sun 8:00]--[2020-05-17 Sun 13:00] =>  5:00
    CLOCK: [2020-05-11 Mon 7:30]--[2020-05-11 Mon 10:00] =>  2:30
    CLOCK: [2020-05-11 Mon 10:30]--[2020-05-11 Mon 13:30] =>  3:00
    CLOCK: [2020-05-12 Tue 8:30]--[2020-05-12 Tue 10:00] =>  1:30
    CLOCK: [2020-05-12 Tue 10:30]--[2020-05-12 Tue 16:00] =>  5:30
    CLOCK: [2020-05-13 Wed 7:30]--[2020-05-13 Wed 10:00] =>  2:30
    CLOCK: [2020-05-13 Wed 10:30]--[2020-05-13 Wed 15:30] =>  5:00
    CLOCK: [2020-05-14 Thu 7:30]--[2020-05-14 Thu 10:00] =>  2:30
    CLOCK: [2020-05-14 Thu 10:30]--[2020-05-14 Thu 17:00] =>  6:30
    CLOCK: [2020-05-15 Fri 9:00]--[2020-05-15 Fri 10:00] =>  1:00
    CLOCK: [2020-05-15 Fri 10:30]--[2020-05-15 Fri 13:00] =>  2:30
    :END:


*** OUT smtp server

** Week 20

*** TODO smtp server
